package com.app.myfoottrip.util

import com.app.myfoottrip.data.dto.ServiceClauseText

val allServiceClauseList: List<ServiceClauseText> = listOf(
    ServiceClauseText(
        "제 1조 [목적]",
        "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n"
    ),
    ServiceClauseText(
        "제 2조 [용어의 정의]",
        "       본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n " +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n" +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n" +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n" +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n" +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n" +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n" +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n" +
                "        본 이용약관은 주식회사 마이풋트립 (이하 “회사”라 합니다)이 운영하는 Website 또는 Application 등 온라인 여행 플랫폼 소비스와 관련하여, 회사와 서비스를 이용하는 자(이하 “이용자”라 합니다) 사이의 권리, 의무, 기타 필요한 사항을 정함으로써 상호 이익을 도모하는 것을 그 목적으로 합니다.\n"
    ),
)